Revit 2027 API
ParameterTypeId.StairsRailingShape Property
 "Rail Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRailingShape { get; }
Public Shared ReadOnly Property StairsRailingShape As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRailingShape {
	ForgeTypeId^ get ();
}
static member StairsRailingShape : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace